sql/sql-intermediate.org
* Company data
** Get the data
#+BEGIN_SRC sh
  sqlite3 data/company.db < data/company.sql
#+END_SRC

#+RESULTS:

** Set db file
Now using :db (print db) in the header of sqlite code blocks will set this as the database
#+BEGIN_SRC emacs-lisp
  (setq db "data/company.db")
#+END_SRC

#+RESULTS:
: data/company.db

** Output the names of employees that Oliver Warbucks directly supervises
#+BEGIN_SRC sqlite :db (print db) :header
  SELECT Name FROM records 
  WHERE Supervisor='Oliver Warbucks';
#+END_SRC

#+RESULTS:
| Name            |
| Ben Bitdiddle   |
| DeWitt Aull     |
| Eben Scrooge    |
| Oliver Warbucks |

** Output all information about self-supervising employees
#+BEGIN_SRC sqlite :db (print db) :header
  SELECT * FROM records WHERE Name=Supervisor
#+END_SRC

#+RESULTS:
| Name            | Division       | Title     | Salary | Supervisor      |
| Oliver Warbucks | Administration | Big Wheel | 150000 | Oliver Warbucks |

** Output names of all employees with salary greater than 50000 in alphabetical order
#+BEGIN_SRC sqlite :db (print db) :header
  SELECT Name FROM records WHERE Salary > 50000 ORDER BY Name;
#+END_SRC

#+RESULTS:
| Name            |
| Ben Bitdiddle   |
| Eben Scrooge    |
| Oliver Warbucks |

** Output table with columns: employee, salary, supervisor, supervisor's salary, containing all supervisors who earn more than twice as much as the employee
#+BEGIN_SRC sqlite :db (print db) :header
  SELECT e.Name, e.Salary, e.Supervisor, s.Salary
  FROM records e JOIN records s ON e.Supervisor=s.Name
  WHERE s.Salary > 2*e.Salary;
#+END_SRC

#+RESULTS:
| Name            | Salary | Supervisor      | Salary |
| Ben Bitdiddle   |  60000 | Oliver Warbucks | 150000 |
| DeWitt Aull     |  25000 | Oliver Warbucks | 150000 |
| Lem E Tweakit   |  25000 | Ben Bitdiddle   |  60000 |
| Robert Cratchet |  18000 | Eben Scrooge    |  75000 |

** Output names of employees whose supervisor is in a different division
#+BEGIN_SRC sqlite :db (print db) :header
  SELECT e.Name
  FROM records e JOIN records s ON e.Supervisor=s.Name
  WHERE e.Division <> s.Division;
#+END_SRC

#+RESULTS:
| Name          |
| Ben Bitdiddle |
| Eben Scrooge  |

** Output meeting days and times of all employees directly supervised by Oliver Warbucks
#+BEGIN_SRC sqlite :db (print db) :header
  SELECT Day, Time FROM meetings
  WHERE Division IN (SELECT Division FROM records WHERE Supervisor='Oliver Warbucks');
#+END_SRC

#+RESULTS:
| Day       | Time |
| Monday    | 9am  |
| Monday    | 11am |
| Thursday  | 1pm  |
| Wednesday | 4pm  |

or to attach names to the meetings:
#+BEGIN_SRC sqlite :db (print db) :header
  SELECT Name, Day, Time
  FROM records r JOIN meetings m ON r.Division=m.Division
  WHERE Supervisor='Oliver Warbucks';
#+END_SRC

#+RESULTS:
| Name            | Day       | Time |
| Ben Bitdiddle   | Wednesday | 4pm  |
| DeWitt Aull     | Monday    | 11am |
| DeWitt Aull     | Thursday  | 1pm  |
| Eben Scrooge    | Monday    | 9am  |
| Oliver Warbucks | Monday    | 11am |
| Oliver Warbucks | Thursday  | 1pm  |

** Output all names of middle managers (people who supervise someone and are supervised)
#+BEGIN_SRC sqlite :db (print db) :header
  SELECT Name FROM records
  WHERE Name != Supervisor
    AND Name IN (SELECT Supervisor FROM records);
#+END_SRC

#+RESULTS:
| Name            |
| Alyssa P Hacker |
| Ben Bitdiddle   |
| Eben Scrooge    |

