sql/sql-intermediate.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>sql-intermediate</title>
<!-- 2017-10-24 Tue 12:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Kira" />
</head>
<body>
<div id="content">
<h1 class="title">sql-intermediate</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Company data</a>
<ul>
<li><a href="#sec-1-1">1.1. Get the data</a></li>
<li><a href="#sec-1-2">1.2. Set db file</a></li>
<li><a href="#sec-1-3">1.3. Output the names of employees that Oliver Warbucks directly supervises</a></li>
<li><a href="#sec-1-4">1.4. Output all information about self-supervising employees</a></li>
<li><a href="#sec-1-5">1.5. Output names of all employees with salary greater than 50000 in alphabetical order</a></li>
<li><a href="#sec-1-6">1.6. Output table with columns: employee, salary, supervisor, supervisor&rsquo;s salary, containing all supervisors who earn more than twice as much as the employee</a></li>
<li><a href="#sec-1-7">1.7. Output names of employees whose supervisor is in a different division</a></li>
<li><a href="#sec-1-8">1.8. Output meeting days and times of all employees directly supervised by Oliver Warbucks</a></li>
<li><a href="#sec-1-9">1.9. Output all names of middle managers (people who supervise someone and are supervised)</a></li>
<li><a href="#sec-1-10">1.10. Get names of all employees who have a meeting on the same day as their supervisor</a></li>
<li><a href="#sec-1-11">1.11. Output each supervisor and the sum of salaries of all of each supervisor&rsquo;s employees</a></li>
<li><a href="#sec-1-12">1.12. Output all salaries that appear more than once in the employee records</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Recursive WITH statements</a>
<ul>
<li><a href="#sec-2-1">2.1. Print out the factorial of the numbers 0 to 10</a></li>
<li><a href="#sec-2-2">2.2. Group natural numbers in 3-number-long sequences</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Presidential dogs</a>
<ul>
<li><a href="#sec-3-1">3.1. Get the data</a></li>
<li><a href="#sec-3-2">3.2. Get names of all dogs with a parent, ordered by height of the parent from tallest to shortest</a></li>
<li><a href="#sec-3-3">3.3. Create a single string for every pair of siblings that have the same size, where each value is a sentence describing the siblings by their size, and each sibling pair only appears once in alphabetical order</a></li>
<li><a href="#sec-3-4">3.4. Create a table describing all stacks of 4 dogs at least 170 cm high</a></li>
<li><a href="#sec-3-5">3.5. Get all pairs forming non-parent relations ordered by height difference, with shortest paired with tallest first, and tallest paired with shortest last.</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Company data</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Get the data</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-sh">sqlite3 data/company.db &lt; data/company.sql
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Set db file</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Now using :db (print db) in the header of sqlite code blocks will set this as the database
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">setq</span> db <span style="color: #a020f0;">"data/company.db"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Output the names of employees that Oliver Warbucks directly supervises</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">SELECT</span> <span style="color: #0000FF;">Name</span> <span style="color: #0000FF;">FROM</span> records 
<span style="color: #0000FF;">WHERE</span> Supervisor=<span style="color: #a020f0;">'Oliver Warbucks'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Output all information about self-supervising employees</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">FROM</span> records <span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">Name</span>=Supervisor
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Output names of all employees with salary greater than 50000 in alphabetical order</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">SELECT</span> <span style="color: #0000FF;">Name</span> <span style="color: #0000FF;">FROM</span> records <span style="color: #0000FF;">WHERE</span> Salary &gt; 50000 <span style="color: #0000FF;">ORDER</span> <span style="color: #0000FF;">BY</span> <span style="color: #0000FF;">Name</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Output table with columns: employee, salary, supervisor, supervisor&rsquo;s salary, containing all supervisors who earn more than twice as much as the employee</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">SELECT</span> e.<span style="color: #0000FF;">Name</span>, e.Salary, e.Supervisor, s.Salary
<span style="color: #0000FF;">FROM</span> records e <span style="color: #0000FF;">JOIN</span> records s <span style="color: #0000FF;">ON</span> e.Supervisor=s.<span style="color: #0000FF;">Name</span>
<span style="color: #0000FF;">WHERE</span> s.Salary &gt; 2*e.Salary;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Output names of employees whose supervisor is in a different division</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">SELECT</span> e.<span style="color: #0000FF;">Name</span>
<span style="color: #0000FF;">FROM</span> records e <span style="color: #0000FF;">JOIN</span> records s <span style="color: #0000FF;">ON</span> e.Supervisor=s.<span style="color: #0000FF;">Name</span>
<span style="color: #0000FF;">WHERE</span> e.Division &lt;&gt; s.Division;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Output meeting days and times of all employees directly supervised by Oliver Warbucks</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">SELECT</span> <span style="color: #0000FF;">Day</span>, <span style="color: #6434A3;">Time</span> <span style="color: #0000FF;">FROM</span> meetings
<span style="color: #0000FF;">WHERE</span> Division <span style="color: #0000FF;">IN</span> (<span style="color: #0000FF;">SELECT</span> Division <span style="color: #0000FF;">FROM</span> records <span style="color: #0000FF;">WHERE</span> Supervisor=<span style="color: #a020f0;">'Oliver Warbucks'</span>);
</pre>
</div>

<p>
or to attach names to the meetings:
</p>
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">SELECT</span> <span style="color: #0000FF;">Name</span>, <span style="color: #0000FF;">Day</span>, <span style="color: #6434A3;">Time</span>
<span style="color: #0000FF;">FROM</span> records r <span style="color: #0000FF;">JOIN</span> meetings <span style="color: #0000FF;">m</span> <span style="color: #0000FF;">ON</span> r.Division=<span style="color: #0000FF;">m</span>.Division
<span style="color: #0000FF;">WHERE</span> Supervisor=<span style="color: #a020f0;">'Oliver Warbucks'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Output all names of middle managers (people who supervise someone and are supervised)</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">SELECT</span> <span style="color: #0000FF;">Name</span> <span style="color: #0000FF;">FROM</span> records
<span style="color: #0000FF;">WHERE</span> <span style="color: #0000FF;">Name</span> != Supervisor
  <span style="color: #0000FF;">AND</span> <span style="color: #0000FF;">Name</span> <span style="color: #0000FF;">IN</span> (<span style="color: #0000FF;">SELECT</span> Supervisor <span style="color: #0000FF;">FROM</span> records);
</pre>
</div>
</div>
</div>
