sql/sql-intermediate.tex
% Created 2017-10-24 Tue 12:51
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[margin=2cm]{geometry}
\author{Kira}
\date{\today}
\title{sql-intermediate}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.2.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{Company data}
\label{sec-1}
\subsection{Get the data}
\label{sec-1-1}
\begin{verbatim}
sqlite3 data/company.db < data/company.sql
\end{verbatim}

\subsection{Set db file}
\label{sec-1-2}
Now using :db (print db) in the header of sqlite code blocks will set this as the database
\begin{verbatim}
(setq db "data/company.db")
\end{verbatim}

\subsection{Output the names of employees that Oliver Warbucks directly supervises}
\label{sec-1-3}
\begin{verbatim}
SELECT Name FROM records 
WHERE Supervisor='Oliver Warbucks';
\end{verbatim}

\subsection{Output all information about self-supervising employees}
\label{sec-1-4}
\begin{verbatim}
SELECT * FROM records WHERE Name=Supervisor
\end{verbatim}

\subsection{Output names of all employees with salary greater than 50000 in alphabetical order}
\label{sec-1-5}
\begin{verbatim}
SELECT Name FROM records WHERE Salary > 50000 ORDER BY Name;
\end{verbatim}

\subsection{Output table with columns: employee, salary, supervisor, supervisor's salary, containing all supervisors who earn more than twice as much as the employee}
\label{sec-1-6}
\begin{verbatim}
SELECT e.Name, e.Salary, e.Supervisor, s.Salary
FROM records e JOIN records s ON e.Supervisor=s.Name
WHERE s.Salary > 2*e.Salary;
\end{verbatim}

\subsection{Output names of employees whose supervisor is in a different division}
\label{sec-1-7}
\begin{verbatim}
SELECT e.Name
FROM records e JOIN records s ON e.Supervisor=s.Name
WHERE e.Division <> s.Division;
\end{verbatim}

\subsection{Output meeting days and times of all employees directly supervised by Oliver Warbucks}
\label{sec-1-8}
\begin{verbatim}
SELECT Day, Time FROM meetings
WHERE Division IN (SELECT Division FROM records WHERE Supervisor='Oliver Warbucks');
\end{verbatim}

or to attach names to the meetings:
\begin{verbatim}
SELECT Name, Day, Time
FROM records r JOIN meetings m ON r.Division=m.Division
WHERE Supervisor='Oliver Warbucks';
\end{verbatim}

\subsection{Output all names of middle managers (people who supervise someone and are supervised)}
\label{sec-1-9}
\begin{verbatim}
SELECT Name FROM records
WHERE Name != Supervisor
  AND Name IN (SELECT Supervisor FROM records);
\end{verbatim}
