sql/sql-intermediate.org
** Get names of all employees who have a meeting on the same day as their supervisor
#+BEGIN_SRC sqlite :db (print db) :header
  SELECT DISTINCT e.Name
  FROM records e JOIN records s ON e.supervisor=s.Name
                 JOIN meetings me ON e.Division=me.Division
                 JOIN meetings ms ON s.Division=ms.Division
  WHERE me.Day=ms.Day;
#+END_SRC

#+RESULTS:
| Name            |
| Alyssa P Hacker |
| Cy D Fect       |
| DeWitt Aull     |
| Eben Scrooge    |
| Lem E Tweakit   |
| Louis Reasoner  |
| Oliver Warbucks |
| Robert Cratchet |

** Output each supervisor and the sum of salaries of all of each supervisor's employees
#+BEGIN_SRC sqlite :db (print db) :header
  SELECT Supervisor, SUM(Salary) FROM records
  GROUP BY Supervisor;
#+END_SRC

#+RESULTS:
| Supervisor      | SUM(Salary) |
| Alyssa P Hacker |       30000 |
| Ben Bitdiddle   |      100000 |
| Eben Scrooge    |       18000 |
| Oliver Warbucks |      310000 |

** Output all salaries that appear more than once in the employee records
#+BEGIN_SRC sqlite :db (print db) :header
  SELECT Salary FROM records
  GROUP BY Salary
  HAVING COUNT(*) > 1;
#+END_SRC

#+RESULTS:
| Salary |
|  25000 |

* Recursive WITH statements
** Print out the factorial of the numbers 0 to 10
#+BEGIN_SRC sqlite :db (print db) :header
  WITH num(n, f) AS (
  SELECT 0, 1 UNION
  SELECT n+1, (n+1)*f FROM num WHERE n <= 10
  )
  SELECT * FROM num;
#+END_SRC

#+RESULTS:
|  n |        f |
|  0 |        1 |
|  1 |        1 |
|  2 |        2 |
|  3 |        6 |
|  4 |       24 |
|  5 |      120 |
|  6 |      720 |
|  7 |     5040 |
|  8 |    40320 |
|  9 |   362880 |
| 10 |  3628800 |
| 11 | 39916800 |

** Group natural numbers in 3-number-long sequences
Should generate this output:
|  0 |  1 |  2 |
|  3 |  4 |  5 |
|  6 |  7 |  8 |
|  9 | 10 | 11 |
| 12 | 13 | 14 |
#+BEGIN_SRC sqlite :db (print db) :header
  WITH num(a, b, c) AS (
  SELECT 0, 1, 2 UNION
  SELECT a+3, b+3, c+3 FROM num WHERE a <= 9
  )
  SELECT * FROM num;
#+END_SRC

#+RESULTS:
|  a |  b |  c |
|  0 |  1 |  2 |
|  3 |  4 |  5 |
|  6 |  7 |  8 |
|  9 | 10 | 11 |
| 12 | 13 | 14 |

* Presidential dogs
** Get the data
#+BEGIN_SRC sh
  sqlite3 data/dogs.db < data/dogs.sql
#+END_SRC

#+RESULTS:

** Get names of all dogs with a parent, ordered by height of the parent from tallest to shortest
#+BEGIN_SRC sqlite :db (print db) :header
  SELECT d.name
  FROM dogs d JOIN parents ON d.name=parents.child
              JOIN dogs p ON parents.parent=p.name
  ORDER BY p.height DESC;
#+END_SRC

#+RESULTS:
| name     |
| herbert  |
| fillmore |
| abraham  |
| delano   |
| grover   |
| barack   |
| clinton  |

** Create a single string for every pair of siblings that have the same size, where each value is a sentence describing the siblings by their size, and each sibling pair only appears once in alphabetical order
Expected output:

=barack and clinton are standard siblings=

=abraham and grover are toy siblings=
#+BEGIN_SRC sqlite :db (print db)
  WITH siblings AS (
       SELECT x.child AS name1, d1.height AS height1, y.child AS name2, d2.height AS height2
       FROM parents x JOIN parents y ON x.parent=y.parent
                      JOIN dogs d1 ON x.child=d1.name
                      JOIN dogs d2 ON y.child=d2.name
       WHERE name1 < name2
  )
  SELECT name1 || " and " || name2 || " are " || s1.size || " siblings"
  FROM siblings AS s JOIN sizes s1 ON (s.height1 > s1.min AND s.height1 <= s1.max)
                     JOIN sizes s2 ON (s.height2 > s2.min AND s.height2 <= s2.max)
  WHERE s1.size = s2.size;
#+END_SRC

#+RESULTS:
| barack and clinton are standard siblings |
| abraham and grover are toy siblings      |

