sql/sql-intermediate.html

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> Get names of all employees who have a meeting on the same day as their supervisor</h3>
<div class="outline-text-3" id="text-1-10">
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">SELECT</span> <span style="color: #0000FF;">DISTINCT</span> e.<span style="color: #0000FF;">Name</span>
<span style="color: #0000FF;">FROM</span> records e <span style="color: #0000FF;">JOIN</span> records s <span style="color: #0000FF;">ON</span> e.supervisor=s.<span style="color: #0000FF;">Name</span>
               <span style="color: #0000FF;">JOIN</span> meetings me <span style="color: #0000FF;">ON</span> e.Division=me.Division
               <span style="color: #0000FF;">JOIN</span> meetings ms <span style="color: #0000FF;">ON</span> s.Division=ms.Division
<span style="color: #0000FF;">WHERE</span> me.<span style="color: #0000FF;">Day</span>=ms.<span style="color: #0000FF;">Day</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> Output each supervisor and the sum of salaries of all of each supervisor&rsquo;s employees</h3>
<div class="outline-text-3" id="text-1-11">
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">SELECT</span> Supervisor, <span style="color: #006FE0;">SUM</span>(Salary) <span style="color: #0000FF;">FROM</span> records
<span style="color: #0000FF;">GROUP</span> <span style="color: #0000FF;">BY</span> Supervisor;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> Output all salaries that appear more than once in the employee records</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">SELECT</span> Salary <span style="color: #0000FF;">FROM</span> records
<span style="color: #0000FF;">GROUP</span> <span style="color: #0000FF;">BY</span> Salary
<span style="color: #0000FF;">HAVING</span> <span style="color: #006FE0;">COUNT</span>(*) &gt; 1;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Recursive WITH statements</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Print out the factorial of the numbers 0 to 10</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">WITH</span> num(n, f) <span style="color: #0000FF;">AS</span> (
<span style="color: #0000FF;">SELECT</span> 0, 1 <span style="color: #0000FF;">UNION</span>
<span style="color: #0000FF;">SELECT</span> n+1, (n+1)*f <span style="color: #0000FF;">FROM</span> num <span style="color: #0000FF;">WHERE</span> n &lt;= 10
)
<span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">FROM</span> num;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Group natural numbers in 3-number-long sequences</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Should generate this output:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">2</td>
</tr>

<tr>
<td class="right">3</td>
<td class="right">4</td>
<td class="right">5</td>
</tr>

<tr>
<td class="right">6</td>
<td class="right">7</td>
<td class="right">8</td>
</tr>

<tr>
<td class="right">9</td>
<td class="right">10</td>
<td class="right">11</td>
</tr>

<tr>
<td class="right">12</td>
<td class="right">13</td>
<td class="right">14</td>
</tr>
</tbody>
</table>
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">WITH</span> num(a, b, c) <span style="color: #0000FF;">AS</span> (
<span style="color: #0000FF;">SELECT</span> 0, 1, 2 <span style="color: #0000FF;">UNION</span>
<span style="color: #0000FF;">SELECT</span> a+3, b+3, c+3 <span style="color: #0000FF;">FROM</span> num <span style="color: #0000FF;">WHERE</span> a &lt;= 9
)
<span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">FROM</span> num;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Presidential dogs</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Get the data</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sh">sqlite3 data/dogs.db &lt; data/dogs.sql
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Get names of all dogs with a parent, ordered by height of the parent from tallest to shortest</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">SELECT</span> d.<span style="color: #0000FF;">name</span>
<span style="color: #0000FF;">FROM</span> dogs d <span style="color: #0000FF;">JOIN</span> parents <span style="color: #0000FF;">ON</span> d.<span style="color: #0000FF;">name</span>=parents.child
            <span style="color: #0000FF;">JOIN</span> dogs p <span style="color: #0000FF;">ON</span> parents.parent=p.<span style="color: #0000FF;">name</span>
<span style="color: #0000FF;">ORDER</span> <span style="color: #0000FF;">BY</span> p.height <span style="color: #0000FF;">DESC</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Create a single string for every pair of siblings that have the same size, where each value is a sentence describing the siblings by their size, and each sibling pair only appears once in alphabetical order</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Expected output:
</p>

<p>
<code>barack and clinton are standard siblings</code>
</p>

<p>
<code>abraham and grover are toy siblings</code>
</p>
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">WITH</span> siblings <span style="color: #0000FF;">AS</span> (
     <span style="color: #0000FF;">SELECT</span> x.child <span style="color: #0000FF;">AS</span> name1, d1.height <span style="color: #0000FF;">AS</span> height1, y.child <span style="color: #0000FF;">AS</span> name2, d2.height <span style="color: #0000FF;">AS</span> height2
     <span style="color: #0000FF;">FROM</span> parents x <span style="color: #0000FF;">JOIN</span> parents y <span style="color: #0000FF;">ON</span> x.parent=y.parent
                    <span style="color: #0000FF;">JOIN</span> dogs d1 <span style="color: #0000FF;">ON</span> x.child=d1.<span style="color: #0000FF;">name</span>
                    <span style="color: #0000FF;">JOIN</span> dogs d2 <span style="color: #0000FF;">ON</span> y.child=d2.<span style="color: #0000FF;">name</span>
     <span style="color: #0000FF;">WHERE</span> name1 &lt; name2
)
<span style="color: #0000FF;">SELECT</span> name1 || " <span style="color: #0000FF;">and</span> " || name2 || " <span style="color: #0000FF;">are</span> " || s1.<span style="color: #0000FF;">size</span> || " siblings"
<span style="color: #0000FF;">FROM</span> siblings <span style="color: #0000FF;">AS</span> s <span style="color: #0000FF;">JOIN</span> sizes s1 <span style="color: #0000FF;">ON</span> (s.height1 &gt; s1.<span style="color: #006FE0;">min</span> <span style="color: #0000FF;">AND</span> s.height1 &lt;= s1.<span style="color: #006FE0;">max</span>)
                   <span style="color: #0000FF;">JOIN</span> sizes s2 <span style="color: #0000FF;">ON</span> (s.height2 &gt; s2.<span style="color: #006FE0;">min</span> <span style="color: #0000FF;">AND</span> s.height2 &lt;= s2.<span style="color: #006FE0;">max</span>)
<span style="color: #0000FF;">WHERE</span> s1.<span style="color: #0000FF;">size</span> = s2.<span style="color: #0000FF;">size</span>;
</pre>
</div>
</div>
</div>
