sql/sql-intermediate.tex

\subsection{Get names of all employees who have a meeting on the same day as their supervisor}
\label{sec-1-10}
\begin{verbatim}
SELECT DISTINCT e.Name
FROM records e JOIN records s ON e.supervisor=s.Name
	       JOIN meetings me ON e.Division=me.Division
	       JOIN meetings ms ON s.Division=ms.Division
WHERE me.Day=ms.Day;
\end{verbatim}

\subsection{Output each supervisor and the sum of salaries of all of each supervisor's employees}
\label{sec-1-11}
\begin{verbatim}
SELECT Supervisor, SUM(Salary) FROM records
GROUP BY Supervisor;
\end{verbatim}

\subsection{Output all salaries that appear more than once in the employee records}
\label{sec-1-12}
\begin{verbatim}
SELECT Salary FROM records
GROUP BY Salary
HAVING COUNT(*) > 1;
\end{verbatim}

\section{Recursive WITH statements}
\label{sec-2}
\subsection{Print out the factorial of the numbers 0 to 10}
\label{sec-2-1}
\begin{verbatim}
WITH num(n, f) AS (
SELECT 0, 1 UNION
SELECT n+1, (n+1)*f FROM num WHERE n <= 10
)
SELECT * FROM num;
\end{verbatim}

\subsection{Group natural numbers in 3-number-long sequences}
\label{sec-2-2}
Should generate this output:
\begin{center}
\begin{tabular}{rrr}
0 & 1 & 2\\
3 & 4 & 5\\
6 & 7 & 8\\
9 & 10 & 11\\
12 & 13 & 14\\
\end{tabular}
\end{center}
\begin{verbatim}
WITH num(a, b, c) AS (
SELECT 0, 1, 2 UNION
SELECT a+3, b+3, c+3 FROM num WHERE a <= 9
)
SELECT * FROM num;
\end{verbatim}

\section{Presidential dogs}
\label{sec-3}
\subsection{Get the data}
\label{sec-3-1}
\begin{verbatim}
sqlite3 data/dogs.db < data/dogs.sql
\end{verbatim}

\subsection{Get names of all dogs with a parent, ordered by height of the parent from tallest to shortest}
\label{sec-3-2}
\begin{verbatim}
SELECT d.name
FROM dogs d JOIN parents ON d.name=parents.child
	    JOIN dogs p ON parents.parent=p.name
ORDER BY p.height DESC;
\end{verbatim}

\subsection{Create a single string for every pair of siblings that have the same size, where each value is a sentence describing the siblings by their size, and each sibling pair only appears once in alphabetical order}
\label{sec-3-3}
Expected output:
\texttt{barack and clinton are standard siblings}
\texttt{abraham and grover are toy siblings}
\begin{verbatim}
WITH siblings AS (
     SELECT x.child AS name1, d1.height AS height1, y.child AS name2, d2.height AS height2
     FROM parents x JOIN parents y ON x.parent=y.parent
		    JOIN dogs d1 ON x.child=d1.name
		    JOIN dogs d2 ON y.child=d2.name
     WHERE name1 < name2
)
SELECT name1 || " and " || name2 || " are " || s1.size || " siblings"
FROM siblings AS s JOIN sizes s1 ON (s.height1 > s1.min AND s.height1 <= s1.max)
		   JOIN sizes s2 ON (s.height2 > s2.min AND s.height2 <= s2.max)
WHERE s1.size = s2.size;
\end{verbatim}
