sql/sql-intermediate.org
** Create a table describing all stacks of 4 dogs at least 170 cm high
The first column should contain a comma-separated list of dogs in the stack, and the second column should contain the total height of the stack. Order the stacks in increasing order of total height. A valid stack of dogs includes each dog only once, and the dogs should be listed in increasing order of height within the stack. *Assume no two dogs have the same height.*

Expected output:
#+BEGIN_SRC verbatim
abraham, delano, clinton, barack|171
grover, delano, clinton, barack|173
herbert, delano, clinton, barack|176
fillmore, delano, clinton, barack|177
eisenhower, delano, clinton, barack|180
#+END_SRC

#+BEGIN_SRC sqlite :db (print db) :header
  WITH stacks4 AS (
       SELECT d1.name||", "||
              d2.name||", "||
              d3.name||", "||
              d4.name AS list, d1.height+d2.height+d3.height+d4.height AS height
       FROM dogs d1 JOIN dogs d2 JOIN dogs d3 JOIN dogs d4
       WHERE d1.height < d2.height
       AND d2.height < d3.height
       AND d3.height < d4.height
  )
  SELECT * FROM stacks4
  WHERE height >= 170
  ORDER BY height ASC;
#+END_SRC

#+RESULTS:
| list                                | height |
| abraham, delano, clinton, barack    |    171 |
| grover, delano, clinton, barack     |    173 |
| herbert, delano, clinton, barack    |    176 |
| fillmore, delano, clinton, barack   |    177 |
| eisenhower, delano, clinton, barack |    180 |

or without a WITH:
#+BEGIN_SRC sqlite :db (print db) :header
  SELECT d1.name||", "||
         d2.name||", "||
         d3.name||", "||
         d4.name AS list,                 d1.height+d2.height+d3.height+d4.height AS stack_height
  FROM dogs d1 JOIN dogs d2 ON d1.height < d2.height
               JOIN dogs d3 ON d2.height < d3.height
               JOIN dogs d4 ON d3.height < d4.height
  WHERE stack_height >= 170
  ORDER BY stack_height ASC;
#+END_SRC

#+RESULTS:
| list                                | stack_height |
| abraham, delano, clinton, barack    |          171 |
| grover, delano, clinton, barack     |          173 |
| herbert, delano, clinton, barack    |          176 |
| fillmore, delano, clinton, barack   |          177 |
| eisenhower, delano, clinton, barack |          180 |

or with a recursive solution:
#+BEGIN_SRC sqlite :db (print db) :header
  WITH stacks(list, topdogHeight, height, n) AS (
       SELECT name, height, height, 1 FROM dogs UNION
       SELECT s.list||", "||d.name, d.height, s.height+d.height, n+1
       FROM stacks s JOIN dogs d ON (s.topdogHeight < d.height)
       WHERE n < 4
  )
  SELECT list, height FROM stacks WHERE n = 4 AND height >= 170 ORDER BY height ASC;
#+END_SRC

#+RESULTS:
| list                                | height |
| abraham, delano, clinton, barack    |    171 |
| grover, delano, clinton, barack     |    173 |
| herbert, delano, clinton, barack    |    176 |
| fillmore, delano, clinton, barack   |    177 |
| eisenhower, delano, clinton, barack |    180 |

** Get all pairs forming non-parent relations ordered by height difference, with shortest paired with tallest first, and tallest paired with shortest last.
#+BEGIN_SRC sqlite :db (print db)
  WITH relation_pairs(d1, d2, dist) AS (
       SELECT parent, child, 1 FROM parents UNION
       SELECT parent, d2, dist+1
       FROM relation_pairs JOIN parents ON child=d1
  ),
  all_relation_pairs(d1, d2, dist) AS (
       SELECT d1, d2, dist FROM relation_pairs UNION
       SELECT d2, d1, dist FROM relation_pairs
  )
  SELECT d1, d2
  FROM all_relation_pairs JOIN dogs x ON d1=x.name
                          JOIN dogs y ON d2=y.name
  WHERE dist > 1
  ORDER BY x.height-y.height;
#+END_SRC

#+RESULTS:
| fillmore   | barack     |
| eisenhower | barack     |
| fillmore   | clinton    |
| eisenhower | clinton    |
| eisenhower | delano     |
| abraham    | eisenhower |
| grover     | eisenhower |
| herbert    | eisenhower |
| herbert    | fillmore   |
| fillmore   | herbert    |
| eisenhower | herbert    |
| eisenhower | grover     |
| eisenhower | abraham    |
| delano     | eisenhower |
| clinton    | eisenhower |
| clinton    | fillmore   |
| barack     | eisenhower |
| barack     | fillmore   |


