sql/sql-intermediate.html

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Create a table describing all stacks of 4 dogs at least 170 cm high</h3>
<div class="outline-text-3" id="text-3-4">
<p>
The first column should contain a comma-separated list of dogs in the stack, and the second column should contain the total height of the stack. Order the stacks in increasing order of total height. A valid stack of dogs includes each dog only once, and the dogs should be listed in increasing order of height within the stack. <b>Assume no two dogs have the same height.</b>
</p>

<p>
Expected output:
</p>
<div class="org-src-container">

<pre class="src src-verbatim">abraham, delano, clinton, barack|171
grover, delano, clinton, barack|173
herbert, delano, clinton, barack|176
fillmore, delano, clinton, barack|177
eisenhower, delano, clinton, barack|180
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">WITH</span> stacks4 <span style="color: #0000FF;">AS</span> (
     <span style="color: #0000FF;">SELECT</span> d1.<span style="color: #0000FF;">name</span>||", "||
            d2.<span style="color: #0000FF;">name</span>||", "||
            d3.<span style="color: #0000FF;">name</span>||", "||
            d4.<span style="color: #0000FF;">name</span> <span style="color: #0000FF;">AS</span> list, d1.height+d2.height+d3.height+d4.height <span style="color: #0000FF;">AS</span> height
     <span style="color: #0000FF;">FROM</span> dogs d1 <span style="color: #0000FF;">JOIN</span> dogs d2 <span style="color: #0000FF;">JOIN</span> dogs d3 <span style="color: #0000FF;">JOIN</span> dogs d4
     <span style="color: #0000FF;">WHERE</span> d1.height &lt; d2.height
     <span style="color: #0000FF;">AND</span> d2.height &lt; d3.height
     <span style="color: #0000FF;">AND</span> d3.height &lt; d4.height
)
<span style="color: #0000FF;">SELECT</span> * <span style="color: #0000FF;">FROM</span> stacks4
<span style="color: #0000FF;">WHERE</span> height &gt;= 170
<span style="color: #0000FF;">ORDER</span> <span style="color: #0000FF;">BY</span> height <span style="color: #0000FF;">ASC</span>;
</pre>
</div>

<p>
or without a WITH:
</p>
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">SELECT</span> d1.<span style="color: #0000FF;">name</span>||", "||
       d2.<span style="color: #0000FF;">name</span>||", "||
       d3.<span style="color: #0000FF;">name</span>||", "||
       d4.<span style="color: #0000FF;">name</span> <span style="color: #0000FF;">AS</span> list,                 d1.height+d2.height+d3.height+d4.height <span style="color: #0000FF;">AS</span> stack_height
<span style="color: #0000FF;">FROM</span> dogs d1 <span style="color: #0000FF;">JOIN</span> dogs d2 <span style="color: #0000FF;">ON</span> d1.height &lt; d2.height
             <span style="color: #0000FF;">JOIN</span> dogs d3 <span style="color: #0000FF;">ON</span> d2.height &lt; d3.height
             <span style="color: #0000FF;">JOIN</span> dogs d4 <span style="color: #0000FF;">ON</span> d3.height &lt; d4.height
<span style="color: #0000FF;">WHERE</span> stack_height &gt;= 170
<span style="color: #0000FF;">ORDER</span> <span style="color: #0000FF;">BY</span> stack_height <span style="color: #0000FF;">ASC</span>;
</pre>
</div>

<p>
or with a recursive solution:
</p>
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">WITH</span> stacks(list, topdogHeight, height, n) <span style="color: #0000FF;">AS</span> (
     <span style="color: #0000FF;">SELECT</span> <span style="color: #0000FF;">name</span>, height, height, 1 <span style="color: #0000FF;">FROM</span> dogs <span style="color: #0000FF;">UNION</span>
     <span style="color: #0000FF;">SELECT</span> s.list||", "||d.<span style="color: #0000FF;">name</span>, d.height, s.height+d.height, n+1
     <span style="color: #0000FF;">FROM</span> stacks s <span style="color: #0000FF;">JOIN</span> dogs d <span style="color: #0000FF;">ON</span> (s.topdogHeight &lt; d.height)
     <span style="color: #0000FF;">WHERE</span> n &lt; 4
)
<span style="color: #0000FF;">SELECT</span> list, height <span style="color: #0000FF;">FROM</span> stacks <span style="color: #0000FF;">WHERE</span> n = 4 <span style="color: #0000FF;">AND</span> height &gt;= 170 <span style="color: #0000FF;">ORDER</span> <span style="color: #0000FF;">BY</span> height <span style="color: #0000FF;">ASC</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Get all pairs forming non-parent relations ordered by height difference, with shortest paired with tallest first, and tallest paired with shortest last.</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">

<pre class="src src-sqlite"><span style="color: #0000FF;">WITH</span> relation_pairs(d1, d2, dist) <span style="color: #0000FF;">AS</span> (
     <span style="color: #0000FF;">SELECT</span> parent, child, 1 <span style="color: #0000FF;">FROM</span> parents <span style="color: #0000FF;">UNION</span>
     <span style="color: #0000FF;">SELECT</span> parent, d2, dist+1
     <span style="color: #0000FF;">FROM</span> relation_pairs <span style="color: #0000FF;">JOIN</span> parents <span style="color: #0000FF;">ON</span> child=d1
),
all_relation_pairs(d1, d2, dist) <span style="color: #0000FF;">AS</span> (
     <span style="color: #0000FF;">SELECT</span> d1, d2, dist <span style="color: #0000FF;">FROM</span> relation_pairs <span style="color: #0000FF;">UNION</span>
     <span style="color: #0000FF;">SELECT</span> d2, d1, dist <span style="color: #0000FF;">FROM</span> relation_pairs
)
<span style="color: #0000FF;">SELECT</span> d1, d2
<span style="color: #0000FF;">FROM</span> all_relation_pairs <span style="color: #0000FF;">JOIN</span> dogs x <span style="color: #0000FF;">ON</span> d1=x.<span style="color: #0000FF;">name</span>
                        <span style="color: #0000FF;">JOIN</span> dogs y <span style="color: #0000FF;">ON</span> d2=y.<span style="color: #0000FF;">name</span>
<span style="color: #0000FF;">WHERE</span> dist &gt; 1
<span style="color: #0000FF;">ORDER</span> <span style="color: #0000FF;">BY</span> x.height-y.height;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kira</p>
<p class="date">Created: 2017-10-24 Tue 12:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
